app/controllers/auctions_controller.rb

  def create
    @auction = Auction.new(params[:auction])
    #@auction.auction_token = params[:auction][:auction_token]
    @auction.user = current_user

    if @auction.auctionable
      @auction.auctionable_type = @auction.auctionable.type
      @auction.auctionable_id = @auction.auctionable.id
      @auction.auctionable.auction = @auction
    else
    end

    if @auction.save
---
INSERT INTO "auctions" ("number_of_products", "minimal_price", "created_at", "updated_at", "end", "user_id", "start", "description", "auctionable_type", "auctionable_id", "buy_now_price") VALUES(1, 0.0, '2009-11-11 21:30:10.567889', '2009-11-11 21:30:10.567889', '2009-11-16 00:00:00.000000', 1, '2009-11-11 00:00:00.000000', E'<p>uboiu</p>', NULL, NULL, 21.0) RETURNING "id"

  def show
    @auction = Auction.find(params[:id])
---
SELECT * FROM "auctions" WHERE ("auctions"."id" = 1)