app/controllers/products_controller.rb

  def create
    #product_type = params[:product_type] || "site_link"
    @product = Kernel.const_get(product_type.classify).new(params[product_type.to_s])
    @t = @product.auction.end
    @product.auction.end = Time.local(@t.year, @t.mon, @t.day, @t.hour)
    #@product.build_auction(params[:product][:auction])
    #@product.auction = params[:product][:auction]
   # @product.attributes = params[product_type]

   # raise params[product_type][:url].to_s

   #@product.auction = @product.build_auction(params[product_type][:auction])

    @product.auction.user = User.find(current_user.id)
   if( @product.auction.save and  @product.save )
---
SELECT * FROM "auctions" WHERE ("auctions".auctionable_id = 3 AND "auctions".auctionable_type = E'SiteLink') LIMIT 1
SELECT * FROM "users" WHERE ("users"."id" = E'1') LIMIT 1
INSERT INTO "auctions" ("number_of_products", "minimal_price", "auctionable_id", "updated_at", "end", "start", "description", "buy_now_price", "user_id", "auctionable_type", "created_at") VALUES(1, 1.0, NULL, '2009-11-12 07:32:41.093000', '2009-11-17 00:00:00.000000', '2009-11-12 00:00:00.000000', E'<p>klmnswoidcq</p>', 12.0, 1, E'SiteLink', '2009-11-12 07:32:41.093000') RETURNING "id"
UPDATE "auctions" SET "created_at" = '2009-11-12 07:32:41.093000', "buy_now_price" = 12.0, "start" = '2009-11-12 00:00:00.000000', "end" = '2009-11-17 00:00:00.000000', "minimal_price" = 1.0, "number_of_products" = 1, "auctionable_type" = E'SiteLink', "auctionable_id" = 8, "description" = E'<p>klmnswoidcq</p>', "updated_at" = '2009-11-12 07:32:41.125000', "user_id" = 1 WHERE "id" = 1
UPDATE "users" SET "persistence_token" = E'058ec506025004a5c6d24468b165cb2eee15a1ab07081786d499ab2db092ecffdc0edd06153f23d7841e6cbdce3cfc6774f7558cbc94ee55f713576ddb0f8002', "login_count" = 2, "failed_login_count" = 0, "current_login_ip" = E'127.0.0.1', "updated_at" = '2009-11-12 00:09:35.987417', "created_at" = '2009-11-11 18:00:40.534219', "email" = E'kuba@kuba.kuba', "perishable_token" = E'19XZF9cO096F7a0b4AA-', "login" = E'kuba', "single_access_token" = E'4DVrB3MWzslN8hbZTKVf', "last_request_at" = '2009-11-12 00:09:35.983967', "last_login_at" = '2009-11-11 18:00:40.531905', "surname" = E'Kubowski', "first_name" = E'kuba', "last_login_ip" = E'127.0.0.1', "password_salt" = E'LKFP-wYAfh9IECaSAUmH', "current_login_at" = '2009-11-11 19:58:29.771814', "crypted_password" = E'db17e2e3fe1231051ff568c98068a5a5f956b6e1c738da97714975f95bed75455e55dd70b0ace8a22d3732e95f20b6da922b8017347bfae771e6b9fd1b7501a8' WHERE "id" = 1

  def edit
    product_type = params[:product_type] || "site_link"

    @product = Kernel.const_get(product_type.classify).find(params[:id])
---
SELECT * FROM "site_links" WHERE ("site_links"."id" = 12)

  def show
    product_type = params[:product_type] || "site_link"
    @bid = Bid.new
    @product = Kernel.const_get(product_type.classify).find(params[:id])
---
SELECT * FROM "site_links" WHERE ("site_links"."id" = 23)