app/controllers/user_sessions_controller.rb

  def create
    @user_session = UserSession.new(params[:user_session])
    if a = User.find_by_login(params[:user_session][:login])
---
SELECT * FROM "users" WHERE (LOWER("users".login) = E'kuba') LIMIT 1