app/controllers/users_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = E'1') LIMIT 1
---
  def ban
    u_id = params[:passed_id]

    @u = User.find(u_id) if u_id

SELECT * FROM "users" WHERE ("users"."id" = E'1') LIMIT 1
---
  def unban
    user_id = params[:passed_id]
    @u = User.find(user_id) if user_id

SELECT * FROM "interests" WHERE ("interests"."id" = 1)
INSERT INTO "users" ("single_access_token", "last_request_at", "created_at", "crypted_password", "perishable_token", "updated_at", "failed_login_count", "current_login_ip", "openid_identifier", "password_salt", "current_login_at", "persistence_token", "login_count", "last_login_ip", "activated", "login", "baseUser_type", "last_login_at", "surname", "email", "baseUser_id", "first_name") VALUES(E'oP-qa3iWwG-nspgCIV5L', '2009-11-07 14:37:58.747043', '2009-11-07 14:37:58.749791', E'7d3cf74f65b328e93244c89a04d9f74b74c8c05baa66b8ed6dc5088ad695def7d2d98fdd11b50bd9818295a1e3be88168e5009f41b10a94bea31904ee3d301fa', E'OIf3-oe6iWgk1vdqkDOU', '2009-11-07 14:37:58.749791', 0, E'127.0.0.1', NULL, E'xEzuwvx9gYmhBQsmDf1r', '2009-11-07 14:37:58.662964', E'65144fc989f150c79a25b03912e75117284efd000d5cd710f3168bade703aa92b68c85aea9b558d14313526cdd649ae1f398a85cd0a8b4de0e952bf87a34579e', 1, NULL, 'f', E'kuba2', NULL, NULL, E' ', E'ja.zajko2@gmail.com', NULL, E' ') RETURNING "id"
---
  def create
    @interests = Interest.find(:all)
    @user = User.new(params[:user])

    if @user.save

SELECT * FROM "users" WHERE ("users"."id" = E'1') LIMIT 1
DELETE FROM "users" WHERE "id" = 7
---
  def destroy
    @user = User.find(params[:id])
    @user.destroy

SELECT * FROM "users" WHERE ("users"."id" = E'1') LIMIT 1
---
  def show
    id = params[:id] || @current_user.id
    @user = User.find(id) if :id

SELECT * FROM "users" WHERE ("users"."id" = E'1') LIMIT 1
---
  def edit
   # allow :admin
   # allow :owner, :of => :user
   if(params[:id])
    @user = User.find(params[:id])

SELECT * FROM "users" ORDER BY login ASC LIMIT 2 OFFSET 0
SELECT count(*) AS count_all FROM "users"
---
  def index
    page = params[:page] || 1
    @users = User.paginate :page => page, :order => 'login ASC'

SELECT * FROM "users" WHERE ("users"."id" = E'1') LIMIT 1
UPDATE "users" SET "persistence_token" = E'5307ccdb57b65b87cf07065484939361c49b1434a71548c8eac170c6f3b24715e0ce3004c19828119cb00f1532ca321bc1ccd22c23a179e6c3d4f16d5e4fbce1', "login_count" = 5, "failed_login_count" = 0, "current_login_ip" = E'127.0.0.1', "updated_at" = '2009-11-07 18:24:46.954457', "created_at" = '2009-11-03 22:44:17.940836', "email" = E'ja.zajko@gmail.com', "perishable_token" = E'Y9kmcj-jwnCo6QWd8JVD', "openid_identifier" = NULL, "login" = E'kuba', "single_access_token" = E'jtSmMfibxAEhQ-UtCtaE', "last_request_at" = '2009-11-07 18:24:46.942526', "baseUser_type" = NULL, "last_login_at" = '2009-11-07 16:56:29.086518', "surname" = E' ', "baseUser_id" = NULL, "first_name" = E' ', "last_login_ip" = E'127.0.0.1', "activated" = 'f', "password_salt" = E'jYRVHusajmfKEnoAsZvc', "current_login_at" = '2009-11-07 18:16:05.655792', "crypted_password" = E'b0515ed29bcc58f10c77a3fa139e4620189bd5dbc4bd19aa2d4cabc577e6f0c737d4fc4dc003970af03535c1f8af3fc3df3c3c9750e868800ca45e0df5cf0ed0' WHERE "id" = 1
---
  def activate
    #postac urla wysyłanego użyszkodnikowi powinna być postaci
    #www.adres.com/users/activate?[id]=<id_użyszkodnika>&[token]=<single_use_token_użytkownika>
    #UWAGA ! nawiasy kwadratowe wokół id i token są KONIECZNE !
      if(!params[:id])
        flash[:notice] = "Podany url aktywacyjny jest nieprawidłowy"
        redirect_to :root

      else
        @user = User.find(params[:id])

        if(params[:token] == @user.single_access_token)
#         @user.activated = true;
          @user.has_no_role!(:not_activated)
          @user.save

UPDATE "users" SET "login_count" = 2, "persistence_token" = E'26a99096b2bcaecd3cb90f75b4a8eabf5b4c88096b8a86757dea32c6f6a13ff1eceef4c627ffc7a9cee58a81dbda0876a9a198d0ffd87b0d97a35844cf503f08', "perishable_token" = E'ruOYCFbPG-MkPWtvGpDU', "last_request_at" = '2009-11-02 12:34:19.234000', "last_login_at" = '2009-11-02 12:26:33.046000', "last_login_ip" = E'127.0.0.1', "crypted_password" = E'0ee703a12539ab1f7324ee99fcc4605dafac5f91fd99120c864ca88144b706dee0e9a2db879f02591d17d9384544c3f221424c2c51c9c2fd06ee18267d7ab235', "updated_at" = '2009-11-02 12:34:19.234000', "current_login_at" = '2009-11-02 12:34:19.234000', "password_salt" = E'czNkiEBn5NHE9XhOkr0z' WHERE "id" = 1
---
  def update
    @user = @current_user # makes our views "cleaner" and more consistent
    params[:user][:login] = @user.login  # zapewnienie, żeby użyszkodnik nie zmienił sobie loginu
    if @user.update_attributes(params[:user])