app/controllers/users_controller.rb

  def index
    @users = User.find(:all, :order => "id")
---
SELECT * FROM "users" WHERE ("users"."id" = E'1') LIMIT 1